Autodesk.Revit.DB.Structure.FabricSheetAlignment
Fabric Sheet alignment in the fabric distribution
Since:
2013
Since:
2013

Autodesk.Revit.DB.Structure.FabricSheetAlignment.BothEdges
The fabric sheets are aligned to starting and ending edge.

Autodesk.Revit.DB.Structure.FabricSheetAlignment.EndingEdge
The fabric sheets are aligned to ending edge.

Autodesk.Revit.DB.Structure.FabricSheetAlignment.StartingEdge
The fabric sheets are aligned to starting edge.

Autodesk.Revit.DB.Structure.FabricSheetAlignment.Null
The fabric sheets are alignment is not set.